#ifndef BASE_SCHEME_OBJECT_H
#define BASE_SCHEME_OBJECT_H
#pragma once


/**
 * object.h object.c
 * 对象结构定义
 * 测试内容见 test/test_cases/object_test.h test/test_cases/vm_test.h test/test_cases/value_test.h
 */


#include <paper-scheme/feature.h>
#include <paper-scheme/opcodes.h>


/**
                               对象类型标记
******************************************************************************/
// todo  增加新类型重写 object_type_enum 枚举
// 基础类型
typedef enum object_type_enum {
    // 0: AnyType
    // 基础类型
            OBJ_I64 = 0,
    OBJ_D64,
    OBJ_CHAR,
    OBJ_BOOLEAN,
    OBJ_UNIT,
    OBJ_EOF,
    OBJ_PAIR,
    OBJ_STRING,
    OBJ_SYMBOL,
    OBJ_VECTOR,

    // 运行时
            OBJ_STACK,
    OBJ_BYTES,
    OBJ_STRING_BUFFER,
    OBJ_STRING_PORT,
    OBJ_STDIO_PORT,
    OBJ_HASH_SET,
    OBJ_HASH_MAP,
    OBJ_WEAK_REF,
    OBJ_WEAK_HASH_SET,
    OBJ_STACK_FRAME,
    OBJ_ENV_SLOT,
    OBJ_PROC,
    OBJ_SYNTAX,
    OBJ_PROMISE,

    // 标记枚举最大值
            OBJECT_TYPE_ENUM_MAX,
} object_type_tag;

// 额外的类型标记, 只用于运行时类型检查, 不属于基础类型系统:
// 因为附加了额外类型标记的对象都是
typedef enum extern_type_enum {
    EXTERN_TYPE_NONE = 0,
    EXTERN_TYPE_ENVIRONMENT,
    EXTERN_TYPE_CLOSURE,
    EXTERN_TYPE_MACRO,
    EXTERN_TYPE_CONTINUATION,
    // 最大值不能超过 uint8max
            EXTERN_TYPE_MAX
} extern_type_tag;
compile_time_assert(((size_t) EXTERN_TYPE_MAX) <= UINT8_MAX);


// 对象头魔数, uint8_t, B1010 1010
#define OBJECT_HEADER_MAGIC (0xAAu)
/**
                               对象内存布局
******************************************************************************/

/**
 * 内存对齐掩码
 * B0111 = 7
 * 对齐到 8 字节整倍数
 */
#ifdef IS_32_BIT_ARCH
compile_time_assert(sizeof(uintptr_t) == 4u);
compile_time_assert(sizeof(void *) == 4u);
compile_time_assert(sizeof(void *) == sizeof(uint32_t));
compile_time_assert(sizeof(double) == 8u);
compile_time_assert(sizeof(double) == sizeof(uint64_t));
// 32位时, 指针和内存分配大小对齐到 8字节, B0111 = 7
# define ALIGN_MASK (7u)
// 指针和内存分配大小的最低 3 bit 必须为 0
# define ALIGN_BITS (3u)
// 对齐到 8u bytes
# define ALIGN_SIZE (8u)
#elif IS_64_BIT_ARCH
compile_time_assert(sizeof(uintptr_t) == 8u);
compile_time_assert(sizeof(void *) == 8u);
compile_time_assert(sizeof(void *) == sizeof(uint64_t));
compile_time_assert(sizeof(double) == 8u);
compile_time_assert(sizeof(double) == sizeof(uint64_t));
// 64位时, 指针和内存分配大小对齐到 8字节, B0111 = 7
# define ALIGN_MASK (7u)
// 指针和内存分配大小的最低 3 bit 必须为 0
# define ALIGN_BITS (3u)
// 对齐到 8u bytes 的整倍数
# define ALIGN_SIZE (8u)
#else
# error("Unknown arch")
#endif

/**
 * 内存对齐检查
 */
#define assert_aligned_ptr_check(x) assert(((((uintptr_t) (x)) & ((uintptr_t) ALIGN_MASK)) == 0u))
#define assert_aligned_size_check(x) assert(((((size_t) (x)) & ((uintptr_t) ALIGN_MASK)) == 0u))


/**
                                基础对象结构声明
******************************************************************************/
// port 类型
enum port_kind {
    // 具有内部缓冲 string_buffer, 参见 https://srfi.schemers.org/srfi-6/srfi-6.html
            PORT_SRFI6 = 1u,
    // 输入 port
            PORT_INPUT = 2u,
    // 输出 port
            PORT_OUTPUT = 4u,
    // port 到达结尾
            PORT_EOF = 8u,
};

struct object_struct_t;
typedef struct object_struct_t *object;


struct object_struct_t {
